Autodesk.Revit.DB.WorksharingDisplayGraphicSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.WorksharingDisplayGraphicSettings.FillColor
The fill color that will be applied to elements when these settings are
applied.  Note that this is automatically set by increasing the luma of
the specified line color by 65%.
Since:
2012

Autodesk.Revit.DB.WorksharingDisplayGraphicSettings.LineColor
The line color that will be applied to elements when these settings are
applied.
Since:
2012

Autodesk.Revit.DB.WorksharingDisplayGraphicSettings.IsApplied
Indicates whether this set of graphic overrides will be applied.
Since:
2012

Autodesk.Revit.DB.WorksharingDisplayGraphicSettings.#ctor(System.Boolean,Autodesk.Revit.DB.Color)
Creates a new instance.
shouldApply:
True if the settings should be applied, False if they should be set but not applied.
lineColor:
The desired line color, which must be a valid color.  Note that the fill
color is calculated automatically from the line color so it is not advisable
to use white, black, or shades of grey.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The lineColor argument does not represent a valid color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WorksharingDisplayGraphicSettings
Represents the graphical settings that can be assigned to elements in the worksharing
display modes.
Since:
2012